Revit 2024 API
DocumentVersion Members
The DocumentVersion type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the DocumentVersion
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEqual
 Checks whether two DocumentVersions are identical. They are identical if both the GUID and number of saves are equal. If two DocumentVersions are identical, they come from the same document, with the same set of changes.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
NumberOfSaves
 The number of times the document has been saved. The save number and GUID are both necessary to uniquely identify a document version.
VersionGUID
 The GUID portion of the DocumentVersion. The GUID is updated when changes are made to the document, but may not update with every change to the document. The GUID and save number are both necessary to uniquely identify a document version.
See Also
DocumentVersion Class
Autodesk.Revit.DB Namespace